app/controllers/memos_controller.rb

  def index
    @memo_new = Memo.new
    @memos = Memo.all
---
SELECT "memos".* FROM "memos"

  def create
    @memo_new = Memo.new(memos_params)
    @memo_new.save
---
INSERT INTO "memos" ("title", "バージョン", "タイトル", "ジャンル", "プレー回数", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", ""], ["バージョン", nil], ["タイトル", nil], ["ジャンル", nil], ["プレー回数", nil], ["description", "あｄｓｆ"], ["created_at", "2024-07-14 17:49:44.000136"], ["updated_at", "2024-07-14 17:49:44.000136"]]

  def destroy_all
    Memo.destroy_all
---
DELETE FROM "memos" WHERE "memos"."id" = ?  [["id", 4]]

  def update
    @memo = Memo.find(params[:id])
    @memo.update(memos_params)
---
SELECT "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "memos" SET "description" = ?, "updated_at" = ? WHERE "memos"."id" = ?  [["description", "更新テスト"], ["updated_at", "2024-06-30 08:01:14.238024"], ["id", 4]]

  def destroy
    @memo = Memo.find(params[:id])
    @memo.destroy
---
SELECT "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "memos" WHERE "memos"."id" = ?  [["id", 1]]